tcv-git/goodmicro/lib/goodmicro_f4/system_stm32f405-439.h
// system_stm32f405-439.h
// PUBLIC DOMAIN
// http:///www.purposeful.co.uk/software/goodmicro

/*
  I, Tom Vajzovic, am the author of this software and its documentation.
  I permanently abandon all intellectual property rights in them, including
  copyright, trademarks, design rights, database right, patents, and the right
  to be identified as the author.

  I am fairly certain that the software does what the documentation says it
  does, but I do not guarantee that it does, or that it does what you think it
  should.  I do not guarantee that it will not have undesirable side effects.

  You are free to use, modify and distribute this software as you please, but
  you do so at your own risk.  If you do not pass on this warning then you may
  be responsible for any problems encountered by those who obtain the software
  through you.
*/

#ifndef SYSTEM_STM32F405_439_H_INCLUDED
#define SYSTEM_STM32F405_439_H_INCLUDED

#include "stm32f4xx.h"
#include "stm32f4xx_missing.h"

#ifdef USE_CLOCK_CONFIG
#include "clock_config.h"
#endif


// #############################################################################
//
//      check part number
//
// #############################################################################

#if !(defined(STM32F405xx) || defined(STM32F415xx) || defined(STM32F407xx) || defined(STM32F417xx) \
   || defined(STM32F427xx) || defined(STM32F437xx) || defined(STM32F429xx) || defined(STM32F439xx))

#error No compatible stm32f4xx part number macro defined
#endif


// #############################################################################
//
//      power settings
//
// #############################################################################

// -----------------------------------------------------------------------------
//  PWR_CR_VOS_Value
// -----------------------------------------------------------------------------

#ifndef PWR_CR_VOS_Value
#define PWR_CR_VOS_Value  PWR_CR_VOS_SCALE1
#endif

#ifdef PWR_CR_VOS_SCALE3

#if (PWR_CR_VOS_Value != PWR_CR_VOS_SCALE1) && (PWR_CR_VOS_Value != PWR_CR_VOS_SCALE2) && (PWR_CR_VOS_Value != PWR_CR_VOS_SCALE3)
#error Invalid definition of PWR_CR_VOS_Value (must be PWR_CR_VOS_SCALE1, PWR_CR_VOS_SCALE2 or PWR_CR_VOS_SCALE3 on this part)
#endif

#else  // PWR_CR_VOS_SCALE3

#if (PWR_CR_VOS_Value != PWR_CR_VOS_SCALE1) && (PWR_CR_VOS_Value != PWR_CR_VOS_SCALE2)
#error Invalid definition of PWR_CR_VOS_Value (must be PWR_CR_VOS_SCALE1 or PWR_CR_VOS_SCALE2 on this part)
#endif

#endif // PWR_CR_VOS_SCALE3

// -----------------------------------------------------------------------------
//  PWR_CR_ODEN_Value
// -----------------------------------------------------------------------------

#ifdef PWR_CR_ODEN_Pos

#ifndef PWR_CR_ODEN_Value

#if (PWR_CR_VOS_Value == PWR_CR_VOS_SCALE3) || (defined(VDD_mV) && (VDD_mV < 2100))

#define PWR_CR_ODEN_Value  PWR_CR_ODEN_DISABLE
#else
#define PWR_CR_ODEN_Value  PWR_CR_ODEN_ENABLE
#endif

#endif // PWR_CR_ODEN_Value

#if (PWR_CR_ODEN_Value != PWR_CR_ODEN_DISABLE) && (PWR_CR_ODEN_Value != PWR_CR_ODEN_ENABLE)
#error Invalid definition of PWR_CR_ODEN_Value (must be PWR_CR_ODEN_DISABLE or PWR_CR_ODEN_ENABLE)
#endif

#if (PWR_CR_VOS_Value == PWR_CR_VOS_SCALE3) && (PWR_CR_ODEN_Value != PWR_CR_ODEN_DISABLE)
#error PWR_CR_VOS_Value is PWR_CR_VOS_SCALE3 but PWR_CR_ODEN_Value is not PWR_CR_ODEN_DISABLE
#endif

#if defined(VDD_mV) && (VDD_mV < 2100) && (PWR_CR_ODEN_Value != PWR_CR_ODEN_DISABLE)
#error VDD_mV is less than 2100 but PWR_CR_ODEN_Value is not PWR_CR_ODEN_DISABLE
#endif

#else  // PWR_CR_ODEN_Pos

#ifdef PWR_CR_ODEN_Value
#error PWR_CR_ODEN_Value is defined but is not available on selected part
#endif

#endif // PWR_CR_ODEN_Pos

// -----------------------------------------------------------------------------
//  SYSCFG_CMPCR_CMP_PD_Value
// -----------------------------------------------------------------------------

#ifndef SYSCFG_CMPCR_CMP_PD_Value

#if defined(VDD_mV) && (VDD_mV < 2400)
#define SYSCFG_CMPCR_CMP_PD_Value  SYSCFG_CMPCR_CMP_PD_DISABLE
#else
#define SYSCFG_CMPCR_CMP_PD_Value  SYSCFG_CMPCR_CMP_PD_ENABLE
#endif

#endif // SYSCFG_CMPCR_CMP_PD_Value

#if (SYSCFG_CMPCR_CMP_PD_Value != SYSCFG_CMPCR_CMP_PD_DISABLE) && (SYSCFG_CMPCR_CMP_PD_Value != SYSCFG_CMPCR_CMP_PD_ENABLE)
#error Invalid definition of SYSCFG_CMPCR_CMP_PD_Value (must be SYSCFG_CMPCR_CMP_PD_DISABLE or SYSCFG_CMPCR_CMP_PD_ENABLE)
#endif

#if defined(VDD_mV) && (VDD_mV < 2400) && (SYSCFG_CMPCR_CMP_PD_Value != SYSCFG_CMPCR_CMP_PD_DISABLE)
#error VDD_mV is less than 2400 but SYSCFG_CMPCR_CMP_PD_Value is not SYSCFG_CMPCR_CMP_PD_DISABLE
#endif


// #############################################################################
//
//      check host bus divider (required to calculate maximum clocks)
//
// #############################################################################

#ifndef HPRE
#define HPRE  1
#endif

#if (HPRE != 1) && (HPRE != 2) && (HPRE != 4) && (HPRE != 8) && (HPRE != 16) && (HPRE != 64) && (HPRE != 128) && (HPRE != 256) && (HPRE != 512)
#error Invalid definition of HPRE (must be one of 1,2,4,8,16,64,128,256,512)
#endif


// #############################################################################
//
//      maximum clocks (depending on power settings)
//
// #############################################################################

// -----------------------------------------------------------------------------
//  SYSCLK_MAX depending on regulator settings
// -----------------------------------------------------------------------------

#if (PWR_CR_VOS_Value == PWR_CR_VOS_SCALE1)

#if defined(PWR_CR_ODEN_Pos) && (PWR_CR_ODEN_Value == PWR_CR_ODEN_ENABLE)
#define SYSCLK_MAX  180000000
#else
#define SYSCLK_MAX  168000000
#endif

#elif (PWR_CR_VOS_Value == PWR_CR_VOS_SCALE2)

#if defined(PWR_CR_ODEN_Pos) && (PWR_CR_ODEN_Value == PWR_CR_ODEN_ENABLE)
#define SYSCLK_MAX  168000000
#else
#define SYSCLK_MAX  144000000
#endif

#else  // PWR_CR_VOS_Value must be PWR_CR_VOS_SCALE3
#define SYSCLK_MAX  120000000
#endif

