tcv-git/goodmicro/lib/goodmicro_f4/system_stm32f405-439.h
// -----------------------------------------------------------------------------
//  FLASH_LATENCY_STEP depending on supply voltage
// -----------------------------------------------------------------------------

#ifndef VDD_mV  // if no VDD_mV, assume Vdd >= 2.7 V
#define                 FLASH_LATENCY_STEP  30000000
#elif (VDD_mV >= 2700)
#define                 FLASH_LATENCY_STEP  30000000   // BOR threshold should be set to level 3
#elif (VDD_mV >= 2400)
#define                 FLASH_LATENCY_STEP  24000000   // BOR threshold should be set to level 2
#elif (VDD_mV >= 2100)
#define                 FLASH_LATENCY_STEP  22000000   // BOR threshold should be set to level 1
#else
#define                 FLASH_LATENCY_STEP  20000000   // BOR should be off
#endif

// -----------------------------------------------------------------------------
//  HCLK_MAX depending on maximum flash latency
// -----------------------------------------------------------------------------

#define HCLK_MAX   (((FLASH_ACR_LATENCY_Msk >> FLASH_ACR_LATENCY_Pos) + 1) * FLASH_LATENCY_STEP)

#if    (SYSCLK_MAX > (HCLK_MAX * HPRE))
#undef  SYSCLK_MAX
#define SYSCLK_MAX   (HCLK_MAX * HPRE)
#endif

// -----------------------------------------------------------------------------
//  APBnCLK_MAX depending on regulator settings
// -----------------------------------------------------------------------------

#if defined(PWR_CR_ODEN_Pos) && (PWR_CR_ODEN_Value == PWR_CR_ODEN_ENABLE)

#define APB1CLK_MAX  45000000
#define APB2CLK_MAX  90000000
#else
#define APB1CLK_MAX  42000000
#define APB2CLK_MAX  84000000
#endif

// -----------------------------------------------------------------------------
//  OUTPUT_FREQUENCY_MAX depending on compensation cell
// -----------------------------------------------------------------------------

#if (SYSCFG_CMPCR_CMP_PD_Value == SYSCFG_CMPCR_CMP_PD_ENABLE)

#define OUTPUT_FREQUENCY_MAX  100000000
#else
#define OUTPUT_FREQUENCY_MAX   50000000
#endif


// #############################################################################
//
//      high-speed external clock settings
//
// #############################################################################

#ifndef RCC_CR_HSEBYP_Value
#define RCC_CR_HSEBYP_Value  RCC_CR_HSEBYP_DISABLE
#endif

#if (RCC_CR_HSEBYP_Value != RCC_CR_HSEBYP_DISABLE) && (RCC_CR_HSEBYP_Value != RCC_CR_HSEBYP_ENABLE)
#error Invalid definition of RCC_CR_HSEBYP_Value (must be RCC_CR_HSEBYP_DISABLE or RCC_CR_HSEBYP_ENABLE)
#endif

#if (RCC_CR_HSEBYP_Value != RCC_CR_HSEBYP_ENABLE)
#define HSE_VALUE_MIN    4000000
#define HSE_VALUE_MAX   26000000
#else
#define HSE_VALUE_MIN    1000000
#define HSE_VALUE_MAX   50000000
#endif

// IMPORTANT: no default definition of HSE_VALUE

#if defined(HSE_VALUE) && ((HSE_VALUE < HSE_VALUE_MIN) || (HSE_VALUE > HSE_VALUE_MAX))
#error Definition of HSE_VALUE out of range
#endif


// #############################################################################
//
//      identify clock source
//
// #############################################################################

#if !defined(RCC_CFGR_SW_Value) && (!defined(HSEON) || (HSEON == 1)) && defined(HSE_VALUE)

#if defined(SYSCLK) && (SYSCLK == HSE_VALUE)
#define                                      RCC_CFGR_SW_Value  RCC_CFGR_SW_HSE
#endif

#if defined(PLLON) && (PLLON == 0) && !defined(SYSCLK)
#define                                      RCC_CFGR_SW_Value  RCC_CFGR_SW_HSE
#endif

#endif // !defined(RCC_CFGR_SW_Value) && (!defined(HSEON) || (HSEON != 0)) && defined(HSE_VALUE)

#if !defined(RCC_CFGR_SW_Value) && (!defined(HISON) || (HSION == 1))

#if defined(SYSCLK) && (SYSCLK == HSI_VALUE)
#define                                      RCC_CFGR_SW_Value  RCC_CFGR_SW_HSI
#endif

#if defined(PLLON) && (PLLON == 0) && !defined(SYSCLK)
#define                                      RCC_CFGR_SW_Value  RCC_CFGR_SW_HSI
#endif

#endif // !defined(RCC_CFGR_SW_Value) && (!defined(HISON) || (HSION != 0))

#ifndef RCC_CFGR_SW_Value
#define RCC_CFGR_SW_Value  RCC_CFGR_SW_PLL
#endif

#if (RCC_CFGR_SW_Value != RCC_CFGR_SW_HSE) && (RCC_CFGR_SW_Value != RCC_CFGR_SW_HSI) && (RCC_CFGR_SW_Value != RCC_CFGR_SW_PLL)
#error Invalid definition of RCC_CFGR_SW_Value
#endif


// #############################################################################
//
//      check clock source (HSI)
//
// #############################################################################

#if (RCC_CFGR_SW_Value == RCC_CFGR_SW_HSI)

#ifndef SYSCLK
#define SYSCLK  HSI_VALUE
#endif

#if (SYSCLK != HSI_VALUE)
#error RCC_CFGR_SW_Value is RCC_CFGR_SW_HSI but SYSCLK does not match HSI_VALUE
#endif

#ifndef HSION
#define HSION  1
#endif

#if (HSION != 1)
#error RCC_CFGR_SW_Value is RCC_CFGR_SW_HSI but HSION is not 1
#endif

#ifndef PLLON
#define PLLON  0
#endif

#endif // (RCC_CFGR_SW_Value == RCC_CFGR_SW_HSI)


// #############################################################################
//
//      check clock source (HSE)
//
// #############################################################################

#if (RCC_CFGR_SW_Value == RCC_CFGR_SW_HSE)

#ifndef HSE_VALUE
#error RCC_CFGR_SW_Value is RCC_CFGR_SW_HSE but HSE_VALUE is undefined
#endif

#ifndef SYSCLK
#define SYSCLK  HSE_VALUE
#endif

#if (SYSCLK != HSE_VALUE)
#error RCC_CFGR_SW_Value is RCC_CFGR_SW_HSE but SYSCLK does not match HSE_VALUE
#endif

#ifndef HSEON
#define HSEON  1
#endif

#if (HSEON != 1)
#error RCC_CFGR_SW_Value is RCC_CFGR_SW_HSE but HSEON is not 1
#endif

#ifndef PLLON
#define PLLON  0
#endif

#endif // (RCC_CFGR_SW_Value == RCC_CFGR_SW_HSE)


// #############################################################################
//
//      check PLL input
//
// #############################################################################

#if (RCC_CFGR_SW_Value == RCC_CFGR_SW_PLL)

#ifndef PLLON
#define PLLON  1
#endif

#if (PLLON != 1)
#error RCC_CFGR_SW_Value is RCC_CFGR_SW_PLL but PLLON is not 1
#endif

#endif // (RCC_CFGR_SW_Value == RCC_CFGR_SW_PLL)

#if defined(HSE_VALUE) && (!defined(HSEON) || (HSEON == 1)) && !defined(RCC_PLLCFGR_PLLSRC_Value)
#define RCC_PLLCFGR_PLLSRC_Value  RCC_PLLCFGR_PLLSRC_HSE
#endif

