tcv-git/goodmicro/lib/goodmicro_f4/system_stm32f405-439.h
#ifndef RCC_PLLCFGR_PLLSRC_Value
#define RCC_PLLCFGR_PLLSRC_Value  RCC_PLLCFGR_PLLSRC_HSI
#endif

#if (RCC_PLLCFGR_PLLSRC_Value != RCC_PLLCFGR_PLLSRC_HSE) && (RCC_PLLCFGR_PLLSRC_Value != RCC_PLLCFGR_PLLSRC_HSI)
#error Invalid definition of RCC_PLLCFGR_PLLSRC_Value
#endif

#if (RCC_PLLCFGR_PLLSRC_Value == RCC_PLLCFGR_PLLSRC_HSE) && !defined(HSE_VALUE)
#error RCC_PLLCFGR_PLLSRC_Value is RCC_PLLCFGR_PLLSRC_HSE but HSE_VALUE is not defined
#endif

#if (RCC_PLLCFGR_PLLSRC_Value == RCC_PLLCFGR_PLLSRC_HSE) && !defined(HSEON)
#define HSEON  1
#endif

#if (RCC_PLLCFGR_PLLSRC_Value == RCC_PLLCFGR_PLLSRC_HSI) && !defined(HSION)
#define HSION  1
#endif

#if (RCC_PLLCFGR_PLLSRC_Value == RCC_PLLCFGR_PLLSRC_HSE) && (HSEON != 1)
#error RCC_PLLCFGR_PLLSRC_Value is RCC_PLLCFGR_PLLSRC_HSE but HSEON is not 1
#endif

#if (RCC_PLLCFGR_PLLSRC_Value == RCC_PLLCFGR_PLLSRC_HSI) && (HSION != 1)
#error RCC_PLLCFGR_PLLSRC_Value is RCC_PLLCFGR_PLLSRC_HSI but HSION is not 1
#endif

#if (RCC_PLLCFGR_PLLSRC_Value == RCC_PLLCFGR_PLLSRC_HSE)
#define PLL_INPUT  HSE_VALUE
#endif

#if (RCC_PLLCFGR_PLLSRC_Value == RCC_PLLCFGR_PLLSRC_HSI)
#define PLL_INPUT  HSI_VALUE
#endif


// #############################################################################
//
//      check SYSCLK configuration
//
// #############################################################################

// IMPORTANT: no default definition of SYSCLK

#if defined(SYSCLK) && (SYSCLK > SYSCLK_MAX)
#error Definition of SYSCLK exceeds maximum possible
#endif

#if (RCC_CFGR_SW_Value == RCC_CFGR_SW_HSE) && defined(HSE_VALUE) && defined(SYSCLK) && (SYSCLK != HSE_VALUE)
#error RCC_CFGR_SW_Value is RCC_CFGR_SW_HSE but SYSCLK is not equal to HSE_VALUE
#endif

#if (RCC_CFGR_SW_Value == RCC_CFGR_SW_HSI) && defined(SYSCLK) && (SYSCLK != HSI_VALUE)
#error RCC_CFGR_SW_Value is RCC_CFGR_SW_HSI but SYSCLK is not equal to HSI_VALUE
#endif

#if (RCC_CFGR_SW_Value == RCC_CFGR_SW_PLL) && defined(SYSCLK) \
  && defined(PLL_M) && defined(PLL_N) && defined(PLL_P) \
  && ((SYSCLK * PLL_M * PLL_P) != (PLL_INPUT * PLL_N))

#error Defined SYSCLK does not agree with defined PLL_M, PLL_N and PLL_P
#endif



// #############################################################################
//
//      PLL configuration requirements
//
// #############################################################################

/*
  External crystal:                           4000000 <=          HSE         <=  26000000
  Integer M:          2 <= M <= 63             950000 <=       (HSE / M)      <=   2100000
  Integer N:         50 <= N <= 432         100000000 <=    ((HSE / M) * N)   <= 432000000
  Integer P:       P = (2 or 4 or 6 or 8)               (((HSE / M) * N) / P) <= 168000000 or 180000000
  Integer Q:          2 <= Q <= 15                      (((HSE / M) * N) / Q) <=  48000000 (exactly 48000000 for USB)
*/

#define VALID_PLL_M(m)        (((m) >= RCC_PLLM_MIN_VALUE) && ((m) <= RCC_PLLM_MAX_VALUE))
#define VALID_PLL_N(n)        (((n) >= RCC_PLLN_MIN_VALUE) && ((n) <= RCC_PLLN_MAX_VALUE))
#define VALID_PLL_P(p)        (((p) == 2) || ((p) == 4) || ((p) == 6) || ((p) == 8))
#define VALID_PLL_Q(q)        (((q) >= RCC_PLLQ_MIN_VALUE) && ((q) <= RCC_PLLQ_MAX_VALUE))


// #############################################################################
//
//      calculate PLL configuration if not defined
//
// #############################################################################

#if (RCC_CFGR_SW_Value == RCC_CFGR_SW_PLL) && !(defined(PLL_M) && defined(PLL_N) && defined(PLL_P))

#ifdef PLL_M
#error PLL_M defined without PLL_N and PLL_P
#endif

#ifdef PLL_N
#error PLL_N defined without PLL_M and PLL_P
#endif

#ifdef PLL_P
#error PLL_P defined without PLL_M and PLL_N
#endif

/*
  PLL configuration will be generated according to the following rules:

  - If HSE_VALUE is defined use HSE for PLL input.
  - If HSE_VALUE is not defined use HSI for PLL input.
  - If SYSCLK is defined provide it exactly or else fail.
  - If SYSCLK is not defined get as close as possible to the maximum allowed frequency.
  - Make the 48MHz clock available for USB if possible.
  - Use even PLL_M if possible.
  - Use the smallest possible PLL_M (highest allowed VCO input).
  - Use the smallest possible PLL_N and PLL_P (lowest allowed VCO output).
  - Use the smallest possible PLL_Q (highest allowed PLL48CLK).
*/

#ifdef SYSCLK

#define N(m,p)                  ((1uLL * SYSCLK * (m) * (p)) / PLL_INPUT)
#define MP_OK_FOR_SYSCLK(m,p)   ((PLL_INPUT * N((m),(p))) == (SYSCLK * (m) * (p)))

#else  // SYSCLK

#define N(m,p)                  ((1uLL * SYSCLK_MAX * (m) * (p)) / PLL_INPUT)
#define MP_OK_FOR_SYSCLK(m,p)   (1)

#endif // SYSCLK

#define VCO_INPUT_IN_RANGE(m)       ((PLL_INPUT >= (RCC_PLLVCO_INPUT_MIN * (m))) && (PLL_INPUT <= (RCC_PLLVCO_INPUT_MAX * (m))))
#define VCO_OUTPUT_IN_RANGE(m,p)    (((PLL_INPUT * N((m),(p))) >= (RCC_PLLVCO_OUTPUT_MIN * (m))) && ((PLL_INPUT * N((m),(p))) <= (RCC_PLLVCO_OUTPUT_MAX * (m))))
#define MP_OK_FOR_VCO(m,p)          (VCO_INPUT_IN_RANGE(m) && VCO_OUTPUT_IN_RANGE((m),(p)))
#define Q(m,n)                      (((PLL_INPUT * (n)) + ((USBCLK_MAX * (m)) - 1)) / (USBCLK_MAX * (m)))
#define MP_OK_FOR_NQ(m,p)           (VALID_PLL_N(N((m),(p))) && VALID_PLL_Q(Q((m),N((m),(p)))))
#define MP_OK(m,p)                  (MP_OK_FOR_VCO((m),(p)) && MP_OK_FOR_NQ((m),(p)) && MP_OK_FOR_SYSCLK((m),(p)))
#define M_OK(m)                     (MP_OK((m),2) || MP_OK((m),4) || MP_OK((m),6) || MP_OK((m),8))
#define USB_POSSIBLE(m,p)           ((PLL_INPUT * N((m),(p))) == (USBCLK_MAX * (m) * Q((m),N((m),(p)))))
#define MP_OK_USB(m,p)              (MP_OK((m),(p)) && USB_POSSIBLE((m),(p)))
#define M_OK_USB(m)                 (MP_OK_USB((m),2) || MP_OK_USB((m),4) || MP_OK_USB((m),6) || MP_OK_USB((m),8))


#if      M_OK_USB( 2)
#define               PLL_M   2
#elif    M_OK_USB( 4)
#define               PLL_M   4
#elif    M_OK_USB( 6)
#define               PLL_M   6
#elif    M_OK_USB( 8)
#define               PLL_M   8
#elif    M_OK_USB(10)
#define               PLL_M  10
#elif    M_OK_USB(12)
#define               PLL_M  12
#elif    M_OK_USB(14)
#define               PLL_M  14
#elif    M_OK_USB(16)
#define               PLL_M  16
#elif    M_OK_USB(18)
#define               PLL_M  18
#elif    M_OK_USB(20)
#define               PLL_M  20
#elif    M_OK_USB(22)
#define               PLL_M  22
#elif    M_OK_USB(24)
#define               PLL_M  24
#elif    M_OK_USB(26)
#define               PLL_M  26
#elif    M_OK_USB( 3)
#define               PLL_M   3
#elif    M_OK_USB( 5)
#define               PLL_M   5
#elif    M_OK_USB( 7)
#define               PLL_M   7
#elif    M_OK_USB( 9)
#define               PLL_M   9
#elif    M_OK_USB(11)
#define               PLL_M  11
#elif    M_OK_USB(13)
#define               PLL_M  13
#elif    M_OK_USB(15)
#define               PLL_M  15
#elif    M_OK_USB(17)
#define               PLL_M  17
#elif    M_OK_USB(19)
#define               PLL_M  19
#elif    M_OK_USB(21)
#define               PLL_M  21
#elif    M_OK_USB(23)
#define               PLL_M  23
#elif    M_OK_USB(25)
#define               PLL_M  25
#elif    M_OK( 2)
#define               PLL_M   2
#elif    M_OK( 4)
#define               PLL_M   4
#elif    M_OK( 6)
#define               PLL_M   6
#elif    M_OK( 8)
#define               PLL_M   8
#elif    M_OK(10)
#define               PLL_M  10
#elif    M_OK(12)
#define               PLL_M  12
#elif    M_OK(14)
#define               PLL_M  14
#elif    M_OK(16)
#define               PLL_M  16
#elif    M_OK(18)
#define               PLL_M  18
#elif    M_OK(20)
#define               PLL_M  20
#elif    M_OK(22)
#define               PLL_M  22
#elif    M_OK(24)
#define               PLL_M  24
#elif    M_OK(26)
#define               PLL_M  26
#elif    M_OK( 3)
#define               PLL_M   3
#elif    M_OK( 5)
#define               PLL_M   5
#elif    M_OK( 7)
#define               PLL_M   7
#elif    M_OK( 9)
#define               PLL_M   9
#elif    M_OK(11)
#define               PLL_M  11
#elif    M_OK(13)
#define               PLL_M  13
#elif    M_OK(15)
#define               PLL_M  15
#elif    M_OK(17)
#define               PLL_M  17
#elif    M_OK(19)
#define               PLL_M  19
#elif    M_OK(21)
#define               PLL_M  21
#elif    M_OK(23)
#define               PLL_M  23
#elif    M_OK(25)
#define               PLL_M  25
#else
#error Cannot find a suitable value for PLL_M
#endif

#ifdef   PLL_M // not #error

