tcv-git/goodmicro/lib/goodmicro_f4/system_stm32f405-439.h
#if      MP_OK_USB(PLL_M, 2)
#define                      PLL_P   2
#elif    MP_OK_USB(PLL_M, 4)
#define                      PLL_P   4
#elif    MP_OK_USB(PLL_M, 6)
#define                      PLL_P   6
#elif    MP_OK_USB(PLL_M, 8)
#define                      PLL_P   8
#elif    MP_OK(PLL_M, 2)
#define                      PLL_P   2
#elif    MP_OK(PLL_M, 4)
#define                      PLL_P   4
#elif    MP_OK(PLL_M, 6)
#define                      PLL_P   6
#elif    MP_OK(PLL_M, 8)
#define                      PLL_P   8
#else
#error Cannot find a suitable value for PLL_P
#endif

#define  PLL_N  N(PLL_M, PLL_P)
#define  PLL_Q  Q(PLL_M, PLL_N)

#endif // not #error

#endif // (RCC_CFGR_SW_Value == RCC_CFGR_SW_PLL) && !(defined(PLL_M) && defined(PLL_N) && defined(PLL_P))


// #############################################################################
//
//      check defined PLL configuration is valid
//
// #############################################################################


#if (PLLON != 0) && !(defined(PLL_M) && defined(PLL_N) && defined(PLL_P))
#error PLLON is set but PLL_M, PLL_N and PLL_P are not all defined
#endif

#ifndef PLL_M
#define PLL_M     16
#endif

#ifndef PLL_N
#define PLL_N    192
#endif

#ifndef PLL_P
#define PLL_P      2
#endif

#ifndef PLL_Q
#if (PLLON != 0)
#define PLL_Q     (((PLL_INPUT * PLL_N) + ((USBCLK_MAX * PLL_M) - 1)) / (USBCLK_MAX * PLL_M))
#else
#define PLL_Q      4
#endif
#endif

#ifndef SSCGEN
#define SSCGEN     0
#endif

#if (SSCGEN != 0) && !(defined(SPREADSEL) && defined(MODPER) && defined(INCSTEP))
#error SSCGEN is set but SPREADSEL, MODPER and INCSTEP are not all defined
#endif

#ifndef SPREADSEL
#define SPREADSEL  0
#endif

#ifndef MODPER
#define MODPER     0
#endif

#ifndef INCSTEP
#define INCSTEP    0
#endif

#if !VALID_PLL_M(PLL_M)
#error Invalid definition of PLL_M (must be in [2:63])
#endif

#if !VALID_PLL_N(PLL_N)
#error Invalid definition of PLL_N (must be in [50:432])
#endif

#if !VALID_PLL_P(PLL_P)
#error Invalid definition of PLL_P (must be one of 2,4,6,8)
#endif

#if !VALID_PLL_Q(PLL_Q)
#error Invalid definition of PLL_Q (must be in [2:15])
#endif

#if defined(PLL_R) && (PLL_R != 2)
#error Invalid definition of PLL_R (must be 2 or undefined)
#endif

#if (SSCGEN != 0) && (SSCGEN != 1)
#error Invalid definition of SSCGEN (must be 0 or 1)
#endif

#if (SPREADSEL != 0) && (SPREADSEL != 1)
#error Invalid definition of SPREADSEL (must be 0 or 1)
#endif

#if (MODPER < 0) || (MODPER >= (1 << 13))
#error Invalid definition of MODPER (must be in [0:8191])
#endif

#if (INCSTEP < 0) || (INCSTEP >= (1 << 15))
#error Invalid definition of INCSTEP (must be in [0:32767])
#endif

#if (SSCGEN != 0) && (PLLON != 1)
#warning SSCGEN is set but PLLON is not 1
#endif

#if (MODPER != 0) && (SSCGEN != 1)
#warning MODPER is defined as non-zero but SSCGEN is not 1
#endif

#if (INCSTEP != 0) && (SSCGEN != 1)
#warning INCSTEP is defined as non-zero but SSCGEN is not 1
#endif

#if (PLLON != 0)

#if (PLL_INPUT < (RCC_PLLVCO_INPUT_MIN * PLL_M)) || (PLL_INPUT > (RCC_PLLVCO_INPUT_MAX * PLL_M))
#error Main PLL VCO input out of range
#endif

#if ((PLL_INPUT * PLL_N) < (RCC_PLLVCO_OUTPUT_MIN * PLL_M)) || ((PLL_INPUT * PLL_N) > (RCC_PLLVCO_OUTPUT_MAX * PLL_M))
#error Main PLL VCO output out of range
#endif

#if (PLL_INPUT * PLL_N) > (SYSCLK_MAX * PLL_M * PLL_P)
#error system core clock exceeds maximum
#endif

#if (PLL_INPUT * PLL_N) > (USBCLK_MAX * PLL_M * PLL_Q)
#error USB clock exceeds maximum
#endif

#if (SSCGEN != 0)

#if ((40000 * MODPER * PLL_M) < PLL_INPUT)
#error PLL spread modulation frequency exceeds maximum (10kHz)
#endif

#if ((MODPER * INCSTEP) >= (1 << 15))
#error PLL spread depth exceeds maximum (MODPER * INCSTEP) >= (1 << 15)
#endif

#if ((500 * MODPER * INCSTEP) > (65534 * PLL_N))
#error PLL spread depth exceeds maximum (2%)
#endif

#endif // (SSCGEN != 0)
#else  // (PLLON != 0)

#if (SSCGEN != 0)
#warning SSCGEN is defined as non-zero but PLLON is 0
#endif

#endif // (PLLON != 0)


// #############################################################################
//
//      check I2S PLL configuration
//
// #############################################################################

#ifndef PLLI2SON
#define PLLI2SON  0
#endif

#if (PLLI2SON != 0) && (PLLI2SON != 1)
#error Invalid definition of PLLI2SON (must be 0 or 1)
#endif

#if (PLLI2SON != 0) && !defined(PLLI2S_N)
#error PLLI2S_N must be defined (because PLLI2SON is 1)
#endif

#if (PLLI2SON != 0) && !defined(PLLI2S_R)
#error PLLI2S_R must be defined (because PLLI2SON is 1)
#endif

#if defined(PLLI2S_N) && ((PLLI2S_N < 50) || (PLLI2S_N > 432))
#error Invalid definition of PLLI2S_N (must be in [50:432])
#endif

#if defined(PLLI2S_R) && ((PLLI2S_R < 2) || (PLLI2S_R > 7))
#error Invalid definition of PLLI2S_R (must be in [2:7])
#endif

#if (PLLI2SON != 0)

#if ((PLL_INPUT * PLLI2S_N) < (RCC_PLLVCO_OUTPUT_MIN * PLL_M)) || ((PLL_INPUT * PLLI2S_N) > (RCC_PLLVCO_OUTPUT_MAX * PLL_M))
#error PLLI2S VCO output out of range [100MHz:432MHz]
#endif

// no limit on PLLI2S_R output frequency stricter than than VCO/2

#else  // (PLLI2SON != 0)

#ifdef PLLI2S_N
#warning PLLI2S_N is defined but PLLI2SON is 0
#endif

#ifdef PLLI2S_Q
#warning PLLI2S_Q is defined but PLLI2SON is 0
#endif

#ifdef PLLI2S_R
#warning PLLI2S_R is defined but PLLI2SON is 0
#endif

#ifndef PLLI2S_N
#define PLLI2S_N  192
#endif

#ifndef PLLI2S_R
#define PLLI2S_R    2
#endif

#endif // (PLLI2SON != 0)

// #############################################################################
//
//      check I2S PLL Q configuration
//
// #############################################################################

#ifdef RCC_PLLI2SCFGR_PLLI2SQ_Pos

#if (PLLI2SON != 0) && !defined(PLLI2S_Q)
#error PLLI2S_Q must be defined (because PLLI2SON is 1)
#endif

#if (PLLI2SON != 0) && !defined(PLLI2SDIVQ)
#error PLLI2SDIVQ must be defined (because PLLI2SON is 1)
#endif

#ifndef PLLI2S_Q
#define PLLI2S_Q    4
#endif

#ifndef PLLI2SDIVQ
#define PLLI2SDIVQ  1
#endif

#if (PLLI2S_Q < 2) || (PLLI2S_Q > 15)
#error Invalid definition of PLLI2S_Q (must be in [2:15])
#endif

#if (PLLI2SDIVQ < 1) || (PLLI2SDIVQ > 32)
#error Invalid definition of PLLI2SDIVQ (must be in [1:32])
#endif

// no limit on PLLI2S_Q output frequency stricter than than VCO/2

