tcv-git/goodmicro/lib/goodmicro_f4/system_stm32f405-439.h
#else  // RCC_PLLI2SCFGR_PLLI2SQ_Pos

#ifdef PLLI2S_Q
#error PLLI2S_Q is defined but is not available on selected part
#endif

#ifdef PLLI2SDIVQ
#error PLLI2SDIVQ is defined but is not available on selected part
#endif

#endif // RCC_PLLI2SCFGR_PLLI2SQ_Pos


// #############################################################################
//
//      check SAI PLL configuration
//
// #############################################################################

#ifdef RCC_PLLSAICFGR_PLLSAIN_Pos

#ifndef PLLSAION
#define PLLSAION  0
#endif

#if (PLLSAION != 0) && (PLLSAION != 1)
#error Invalid definition of PLLSAION (must be 0 or 1)
#endif

#if (PLLSAION != 0) && !defined(PLLSAI_N)
#error PLLSAI_N must be defined (because PLLSAION is 1)
#endif

#if (PLLSAION != 0) && !defined(PLLSAI_Q)
#error PLLSAI_Q must be defined (because PLLSAION is 1)
#endif

#if (PLLSAION != 0) && !defined(PLLSAI_R)
#error PLLSAI_R must be defined (because PLLSAION is 1)
#endif

#if (PLLSAION != 0) && !defined(PLLSAIDIVQ)
#error PLLSAIDIVQ must be defined (because PLLSAION is 1)
#endif

#if (PLLSAION != 0) && !defined(PLLSAIDIVR)
#error PLLSAIDIVR must be defined (because PLLSAION is 1)
#endif

#if defined(PLLSAI_N) && ((PLLSAI_N < 50) || (PLLSAI_N > 432))
#error Invalid definition of PLLSAI_N (must be in [50:432])
#endif

#if defined(PLLSAI_Q) && ((PLLSAI_Q < 2) || (PLLSAI_Q > 15))
#error Invalid definition of PLLSAI_Q (must be in [2:15])
#endif

#if defined(PLLSAI_R) && ((PLLSAI_R < 2) || (PLLSAI_R > 7))
#error Invalid definition of PLLSAI_R (must be in [2:7])
#endif

#ifndef PLLSAIDIVQ
#define PLLSAIDIVQ  1
#endif

#ifndef PLLSAIDIVR
#define PLLSAIDIVR  2
#endif

#if (PLLSAIDIVQ < 1) || (PLLSAIDIVQ > 32)
#error Invalid definition of PLLSAIDIVQ (must be in [1:32])
#endif

#if (PLLSAIDIVR != 2) && (PLLSAIDIVR != 4) && (PLLSAIDIVR != 8) && (PLLSAIDIVR != 16)
#error Invalid definition of PLLSAIDIVR (must be one of 2,4,8,16)
#endif

#if (PLLSAION != 0)

#if ((PLL_INPUT * PLLSAI_N) < (RCC_PLLVCO_OUTPUT_MIN * PLL_M)) || ((PLL_INPUT * PLLSAI_N) > (RCC_PLLVCO_OUTPUT_MAX * PLL_M))
#error PLLSAI VCO output out of range [100MHz:432MHz]
#endif

// no limit on PLLSAI_Q output frequency stricter than than VCO/2
// no limit on PLLSAI_R output frequency stricter than than VCO/2

#else  // (PLLSAION != 0)

#ifdef PLLSAI_N
#warning PLLSAI_N is defined but PLLSAION is 0
#endif

#ifdef PLLSAI_Q
#warning PLLSAI_Q is defined but PLLSAION is 0
#endif

#ifdef PLLSAI_R
#warning PLLSAI_R is defined but PLLSAION is 0
#endif

#ifndef PLLSAI_N
#define PLLSAI_N  192
#endif

#ifndef PLLSAI_Q
#define PLLSAI_Q    4
#endif

#ifndef PLLSAI_R
#define PLLSAI_R    2
#endif

#endif // (PLLSAION != 0)

#else  // RCC_PLLSAICFGR_PLLSAIN_Pos

#ifdef PLLSAION
#error PLLSAION is defined but is not available on selected part
#endif

#ifdef PLLSAI_N
#error PLLSAI_N is defined but is not available on selected part
#endif

#ifdef PLLSAI_Q
#error PLLSAI_Q is defined but is not available on selected part
#endif

#ifdef PLLSAI_R
#error PLLSAI_R is defined but is not available on selected part
#endif

#ifdef PLLSAIDIVQ
#error PLLSAIDIVQ is defined but is not available on selected part
#endif

#ifdef PLLSAIDIVR
#error PLLSAIDIVR is defined but is not available on selected part
#endif

#endif // RCC_PLLSAICFGR_PLLSAIN_Pos


// #############################################################################
//
//      calculate bus clocks
//
// #############################################################################

// -----------------------------------------------------------------------------
//      check peripheral bus dividers
// -----------------------------------------------------------------------------

#if defined(PPRE2) && (PPRE2 != 1) && (PPRE2 != 2) && (PPRE2 != 4) && (PPRE2 != 8) && (PPRE2 != 16)
#error Invalid definition of PPRE2 (must be one of 1,2,4,8,16)
#endif

#if defined(PPRE1) && (PPRE1 != 1) && (PPRE1 != 2) && (PPRE1 != 4) && (PPRE1 != 8) && (PPRE1 != 16)
#error Invalid definition of PPRE1 (must be one of 1,2,4,8,16)
#endif

// -----------------------------------------------------------------------------
//      calculate bus clocks (wihout PLL)
// -----------------------------------------------------------------------------

#if (RCC_CFGR_SW_Value != RCC_CFGR_SW_PLL)

#if (RCC_CFGR_SW_Value == RCC_CFGR_SW_HSE) && !defined(SYSCLK)

#define SYSCLK  HSE_VALUE
#endif

#if (RCC_CFGR_SW_Value == RCC_CFGR_SW_HSI) && !defined(SYSCLK)

#define SYSCLK  HSI_VALUE
#endif

#if   (SYSCLK <= (APB1CLK_MAX * HPRE * 1)) && !defined(PPRE1)
#define                                                       PPRE1   1
#elif (SYSCLK <= (APB1CLK_MAX * HPRE * 2)) && !defined(PPRE1)
#define                                                       PPRE1   2
#elif (SYSCLK <= (APB1CLK_MAX * HPRE * 4)) && !defined(PPRE1)
#define                                                       PPRE1   4
#elif (SYSCLK <= (APB1CLK_MAX * HPRE * 8)) && !defined(PPRE1)
#define                                                       PPRE1   8
#elif                                         !defined(PPRE1)
#define                                                       PPRE1  16
#endif

#if   (SYSCLK <= (APB2CLK_MAX * HPRE * 1)) && !defined(PPRE2)
#define                                                       PPRE2   1
#elif (SYSCLK <= (APB2CLK_MAX * HPRE * 2)) && !defined(PPRE2)
#define                                                       PPRE2   2
#elif (SYSCLK <= (APB2CLK_MAX * HPRE * 4)) && !defined(PPRE2)
#define                                                       PPRE2   4
#elif (SYSCLK <= (APB2CLK_MAX * HPRE * 8)) && !defined(PPRE2)
#define                                                       PPRE2   8
#elif                                         !defined(PPRE2)
#define                                                       PPRE2  16
#endif

#if (SYSCLK > (APB1CLK_MAX * HPRE * PPRE1))
#error APB1 clock exceeds maximum
#endif

#if (SYSCLK > (APB2CLK_MAX * HPRE * PPRE2))
#error APB2 clock exceeds maximum
#endif

#define HCLK      ((1uLL * SYSCLK) / (HPRE        ))
#define APB1_CLK  ((1uLL * SYSCLK) / (HPRE * PPRE1))
#define APB2_CLK  ((1uLL * SYSCLK) / (HPRE * PPRE2))

#endif // (RCC_CFGR_SW_Value != RCC_CFGR_SW_PLL)

