tcv-git/goodmicro/lib/goodmicro_f4/system_stm32f405-439.h
// -----------------------------------------------------------------------------
//      calculate bus clocks (with PLL)
// -----------------------------------------------------------------------------

#if (RCC_CFGR_SW_Value == RCC_CFGR_SW_PLL)

#if   ((PLL_INPUT * PLL_N) <= (APB1CLK_MAX * PLL_M * PLL_P * HPRE * 1)) && !defined(PPRE1)
#define                                                                                    PPRE1   1
#elif ((PLL_INPUT * PLL_N) <= (APB1CLK_MAX * PLL_M * PLL_P * HPRE * 2)) && !defined(PPRE1)
#define                                                                                    PPRE1   2
#elif ((PLL_INPUT * PLL_N) <= (APB1CLK_MAX * PLL_M * PLL_P * HPRE * 4)) && !defined(PPRE1)
#define                                                                                    PPRE1   4
#elif ((PLL_INPUT * PLL_N) <= (APB1CLK_MAX * PLL_M * PLL_P * HPRE * 8)) && !defined(PPRE1)
#define                                                                                    PPRE1   8
#elif                                                                      !defined(PPRE1)
#define                                                                                    PPRE1  16
#endif

#if   ((PLL_INPUT * PLL_N) <= (APB2CLK_MAX * PLL_M * PLL_P * HPRE * 1)) && !defined(PPRE2)
#define                                                                                    PPRE2   1
#elif ((PLL_INPUT * PLL_N) <= (APB2CLK_MAX * PLL_M * PLL_P * HPRE * 2)) && !defined(PPRE2)
#define                                                                                    PPRE2   2
#elif ((PLL_INPUT * PLL_N) <= (APB2CLK_MAX * PLL_M * PLL_P * HPRE * 4)) && !defined(PPRE2)
#define                                                                                    PPRE2   4
#elif ((PLL_INPUT * PLL_N) <= (APB2CLK_MAX * PLL_M * PLL_P * HPRE * 8)) && !defined(PPRE2)
#define                                                                                    PPRE2   8
#elif                                                                      !defined(PPRE2)
#define                                                                                    PPRE2  16
#endif

#if (PLL_INPUT * PLL_N) > (APB1CLK_MAX * PLL_M * PLL_P * HPRE * PPRE1)
#error APB1 clock exceeds maximum
#endif

#if (PLL_INPUT * PLL_N) > (APB2CLK_MAX * PLL_M * PLL_P * HPRE * PPRE2)
#error APB2 clock exceeds maximum
#endif

#ifndef SYSCLK
#define SYSCLK    ((1uLL * PLL_INPUT * PLL_N) / (PLL_M * PLL_P               ))
#endif

#define HCLK      ((1uLL * PLL_INPUT * PLL_N) / (PLL_M * PLL_P * HPRE        ))
#define APB1_CLK  ((1uLL * PLL_INPUT * PLL_N) / (PLL_M * PLL_P * HPRE * PPRE1))
#define APB2_CLK  ((1uLL * PLL_INPUT * PLL_N) / (PLL_M * PLL_P * HPRE * PPRE2))

#endif // (RCC_CFGR_SW_Value == RCC_CFGR_SW_PLL)


// #############################################################################
//
//      Timer clock configuration
//
// #############################################################################

#ifdef RCC_DCKCFGR_TIMPRE_Pos

#ifndef TIMPRE
#define TIMPRE  1
#endif

#if (TIMPRE != 0) && (TIMPRE != 1)
#error Invalid definition of TIMPRE (must be 0 or 1)
#endif

#else  // RCC_DCKCFGR_TIMPRE_Pos

#ifdef TIMPRE
#error TIMPRE is defined but is not available on selected part
#endif

#endif // RCC_DCKCFGR_TIMPRE_Pos

// -----------------------------------------------------------------------------
//      calculate timer clocks (without PLL)
// -----------------------------------------------------------------------------

#if (RCC_CFGR_SW_Value != RCC_CFGR_SW_PLL)

#if defined(TIMPRE) && (TIMPRE == 1)

#if (PPRE1 <= 4)
#define APB1_TIM_CLK    HCLK
#else
#define APB1_TIM_CLK    ((4uLL * SYSCLK) / (HPRE * PPRE1))
#endif

#if (PPRE2 <= 4)
#define APB2_TIM_CLK    HCLK
#else
#define APB2_TIM_CLK    ((4uLL * SYSCLK) / (HPRE * PPRE2))
#endif

#else  // (TIMPRE == 1)

#if (PPRE1 == 1)
#define APB1_TIM_CLK    APB1_CLK
#else
#define APB1_TIM_CLK    ((2uLL * SYSCLK) / (HPRE * PPRE1))
#endif

#if (PPRE2 == 1)
#define APB2_TIM_CLK    APB2_CLK
#else
#define APB2_TIM_CLK    ((2uLL * SYSCLK) / (HPRE * PPRE2))
#endif

#endif // (TIMPRE == 1)

#endif // (RCC_CFGR_SW_Value != RCC_CFGR_SW_PLL)

// -----------------------------------------------------------------------------
//      calculate timer clocks (with PLL)
// -----------------------------------------------------------------------------

#if (RCC_CFGR_SW_Value == RCC_CFGR_SW_PLL)

#if defined(TIMPRE) && (TIMPRE == 1)

#if (PPRE1 <= 4)
#define APB1_TIM_CLK  HCLK
#else
#define APB1_TIM_CLK  ((4uLL * PLL_INPUT * PLL_N) / (PLL_M * PLL_P * HPRE * PPRE1))
#endif

#if (PPRE2 <= 4)
#define APB2_TIM_CLK  HCLK
#else
#define APB2_TIM_CLK  ((4uLL * PLL_INPUT * PLL_N) / (PLL_M * PLL_P * HPRE * PPRE2))
#endif

#else  // (TIMPRE == 1)

#if (PPRE1 == 1)
#define APB1_TIM_CLK  APB1_CLK
#else
#define APB1_TIM_CLK  ((2uLL * PLL_INPUT * PLL_N) / (PLL_M * PLL_P * HPRE * PPRE1))
#endif

#if (PPRE2 == 1)
#define APB2_TIM_CLK  APB2_CLK
#else
#define APB2_TIM_CLK  ((2uLL * PLL_INPUT * PLL_N) / (PLL_M * PLL_P * HPRE * PPRE2))
#endif

#endif // (TIMPRE == 1)

#endif // (RCC_CFGR_SW_Value == RCC_CFGR_SW_PLL)

// -----------------------------------------------------------------------------
//      define timer clocks
// -----------------------------------------------------------------------------

#define TIM1_CLK   APB2_TIM_CLK
#define TIM2_CLK   APB1_TIM_CLK
#define TIM3_CLK   APB1_TIM_CLK
#define TIM4_CLK   APB1_TIM_CLK
#define TIM5_CLK   APB1_TIM_CLK
#define TIM6_CLK   APB1_TIM_CLK
#define TIM7_CLK   APB1_TIM_CLK
#define TIM8_CLK   APB2_TIM_CLK
#define TIM9_CLK   APB2_TIM_CLK
#define TIM10_CLK  APB2_TIM_CLK
#define TIM11_CLK  APB2_TIM_CLK
#define TIM12_CLK  APB1_TIM_CLK
#define TIM13_CLK  APB1_TIM_CLK
#define TIM14_CLK  APB1_TIM_CLK


// #############################################################################
//
//      flash interface settings
//
// #############################################################################

#define FLASH_LATENCY  ((HCLK - 1uLL) / FLASH_LATENCY_STEP)

#if (FLASH_LATENCY > (FLASH_ACR_LATENCY_Msk >> FLASH_ACR_LATENCY_Pos))
#error Host bus too fast for flash access
#endif


// #############################################################################
//
//      clock output configuration
//
// #############################################################################

