tcv-git/goodmicro/lib/goodmicro_f4/system_stm32f405-439.h
// -----------------------------------------------------------------------------
//      clock output source definitions
// -----------------------------------------------------------------------------

#ifndef RCC_CFGR_MCO1_Value
#define RCC_CFGR_MCO1_Value  RCC_CFGR_MCO1_HSI
#endif

#ifndef RCC_CFGR_MCO2_Value
#define RCC_CFGR_MCO2_Value  RCC_CFGR_MCO2_SYSCLK
#endif

#if (RCC_CFGR_MCO1_Value != RCC_CFGR_MCO1_HSI) && (RCC_CFGR_MCO1_Value != RCC_CFGR_MCO1_LSE) && (RCC_CFGR_MCO1_Value != RCC_CFGR_MCO1_HSE) && (RCC_CFGR_MCO1_Value != RCC_CFGR_MCO1_PLL)
#error Invalid definition of RCC_CFGR_MCO1_Value (must be one of RCC_CFGR_MCO1_HSI, RCC_CFGR_MCO1_LSE, RCC_CFGR_MCO1_HSE, RCC_CFGR_MCO1_PLL)
#endif

#if (RCC_CFGR_MCO2_Value != RCC_CFGR_MCO2_SYSCLK) && (RCC_CFGR_MCO2_Value != RCC_CFGR_MCO2_PLLI2S) && (RCC_CFGR_MCO2_Value != RCC_CFGR_MCO2_HSE) && (RCC_CFGR_MCO2_Value != RCC_CFGR_MCO2_PLL)
#error Invalid definition of RCC_CFGR_MCO2_Value (must be one of RCC_CFGR_MCO2_SYSCLK, RCC_CFGR_MCO2_PLLI2S, RCC_CFGR_MCO2_HSE, RCC_CFGR_MCO2_PLL)
#endif

// -----------------------------------------------------------------------------
//      clock output source enable
// -----------------------------------------------------------------------------

#if (RCC_CFGR_MCO1_Value == RCC_CFGR_MCO1_HSI) && !defined(HSION)
#define HSION  1
#endif

#if (RCC_CFGR_MCO1_Value == RCC_CFGR_MCO1_HSE) && !defined(HSEON)
#define HSEON  1
#endif

#if (RCC_CFGR_MCO2_Value == RCC_CFGR_MCO2_HSE) && !defined(HSEON)
#define HSEON  1
#endif

#if (RCC_CFGR_MCO1_Value == RCC_CFGR_MCO1_HSI) && (HSION != 1)
#error RCC_CFGR_MCO1_Value is RCC_CFGR_MCO1_HSI but HSION is not 1
#endif

#if (RCC_CFGR_MCO1_Value == RCC_CFGR_MCO1_HSE) && (HSEON != 1)
#error RCC_CFGR_MCO1_Value is RCC_CFGR_MCO1_HSE but HSEON is not 1
#endif

#if (RCC_CFGR_MCO1_Value == RCC_CFGR_MCO1_PLL) && (PLLON != 1)
#error RCC_CFGR_MCO1_Value is RCC_CFGR_MCO1_PLL but PLLON is not 1
#endif

#if (RCC_CFGR_MCO2_Value == RCC_CFGR_MCO2_HSE) && (HSEON != 1)
#error RCC_CFGR_MCO2_Value is RCC_CFGR_MCO2_HSE but HSEON is not 1
#endif

#if (RCC_CFGR_MCO2_Value == RCC_CFGR_MCO2_PLL) && (PLLON != 1)
#error RCC_CFGR_MCO2_Value is RCC_CFGR_MCO2_PLL but PLLON is not 1
#endif

#if (RCC_CFGR_MCO2_Value == RCC_CFGR_MCO2_PLLI2S) && (PLLI2SON != 1)
#error RCC_CFGR_MCO2_Value is RCC_CFGR_MCO2_PLLI2S but PLLI2SON is not 1
#endif

// -----------------------------------------------------------------------------
//      clock output minimum dividers
// -----------------------------------------------------------------------------

#if (RCC_CFGR_MCO1_Value == RCC_CFGR_MCO1_PLL)

#define MCO1PRE_MIN  (((PLL_INPUT * PLL_N) + (PLL_M * PLL_P * OUTPUT_FREQUENCY_MAX) - 1) / (PLL_M * PLL_P * OUTPUT_FREQUENCY_MAX))
#else
#define MCO1PRE_MIN  1
#endif

#if (RCC_CFGR_MCO2_Value == RCC_CFGR_MCO2_PLL)

#define MCO2PRE_MIN  (((PLL_INPUT * PLL_N) + (PLL_M * PLL_P * OUTPUT_FREQUENCY_MAX) - 1) / (PLL_M * PLL_P * OUTPUT_FREQUENCY_MAX))

#elif (RCC_CFGR_MCO2_Value == RCC_CFGR_MCO2_PLLI2S)

#define MCO2PRE_MIN  (((PLL_INPUT * PLLI2S_N) + (PLL_M * PLLI2S_R * OUTPUT_FREQUENCY_MAX) - 1) / (PLL_M * PLLI2S_R * OUTPUT_FREQUENCY_MAX))

#elif (RCC_CFGR_MCO2_Value == RCC_CFGR_MCO2_SYSCLK) && (RCC_CFGR_SW_Value == RCC_CFGR_SW_PLL)

// FIXME should this include HPRE?
#define MCO2PRE_MIN  (((PLL_INPUT * PLL_N) + (PLL_M * PLL_P * HPRE * OUTPUT_FREQUENCY_MAX) - 1) / (PLL_M * PLL_P * HPRE * OUTPUT_FREQUENCY_MAX))

#else
#define MCO2PRE_MIN  1
#endif

// -----------------------------------------------------------------------------
//      clock output divider definitions
// -----------------------------------------------------------------------------

#ifndef MCO1PRE
#define MCO1PRE  MCO1PRE_MIN
#endif

#ifndef MCO2PRE
#define MCO2PRE  MCO2PRE_MIN
#endif

#if ((MCO1PRE < 1) || (MCO1PRE > 5))
#error Invalid definition of MCO1PRE (must be in [1:5])
#endif

#if ((MCO2PRE < 1) || (MCO2PRE > 5))
#error Invalid definition of MCO2PRE (must be in [1:5])
#endif

// -----------------------------------------------------------------------------
//      check clock output frequency
// -----------------------------------------------------------------------------

#if (RCC_CFGR_MCO1_Value == RCC_CFGR_MCO1_PLL) && (PLLON != 0) && ((PLL_INPUT * PLL_N) > (OUTPUT_FREQUENCY_MAX * PLL_M * PLL_P * MCO1PRE))
#error MCO1 exceeds maximum output frequency
#endif

#if (RCC_CFGR_MCO2_Value == RCC_CFGR_MCO2_PLL) && (PLLON != 0) && ((PLL_INPUT * PLL_N) > (OUTPUT_FREQUENCY_MAX * PLL_M * PLL_P * MCO1PRE))
#error MCO2 exceeds maximum output frequency
#endif

#if (RCC_CFGR_MCO2_Value == RCC_CFGR_MCO2_SYSCLK) && (RCC_CFGR_SW_Value == RCC_CFGR_SW_PLL) && ((PLL_INPUT * PLL_N) > (OUTPUT_FREQUENCY_MAX * PLL_M * PLL_P * MCO2PRE))
#error MCO2 exceeds maximum output frequency
#endif

#if (RCC_CFGR_MCO2_Value == RCC_CFGR_MCO2_PLLI2S) && (PLLI2SON != 0) && ((PLL_INPUT * PLLI2S_N) > (OUTPUT_FREQUENCY_MAX * PLL_M * PLLI2S_R * MCO2PRE))
#error MCO2 exceeds maximum output frequency
#endif


// #############################################################################
//
//      real time clock prescaler
//
// #############################################################################

#ifndef RTCPRE
#ifndef HSE_VALUE
#define                         RTCPRE   0u
#elif (HSE_VALUE <   2500000)
#define                         RTCPRE   2u
#elif (HSE_VALUE >= 30500000)
#define                         RTCPRE  31u
#else
#define                         RTCPRE  ((HSE_VALUE + 500000u) / 1000000u)
#endif
#endif // RTCPRE

#if (RTCPRE < 0) || (RTCPRE > 31)
#error Invalid definition of RTCPRE (must be in [0:31])
#endif


// #############################################################################
//
//      oscillators off if unused
//
// #############################################################################

#ifndef HSION
#define HSION  0
#endif

#ifndef HSEON
#define HSEON  0
#endif

#endif // SYSTEM_STM32F405_439_H_INCLUDED
